GeehySemi/APM32F4xx_SDK/Examples/Board_APM32F427_Tiny/PMU/PMU_Consumption/Source/main.c
/*!
 * @file        main.c
 *
 * @brief       Main program body
 *
 * @version     V1.0.0
 *
 * @date        2025-02-15
 *
 * @attention
 *
 *  Copyright (C) 2025 Geehy Semiconductor
 *
 *  You may not use this file except in compliance with the
 *  GEEHY COPYRIGHT NOTICE (GEEHY SOFTWARE PACKAGE LICENSE).
 *
 *  The program is only for reference, which is distributed in the hope
 *  that it will be useful and instructional for customers to develop
 *  their software. Unless required by applicable law or agreed to in
 *  writing, the program is distributed on an "AS IS" BASIS, WITHOUT
 *  ANY WARRANTY OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the GEEHY SOFTWARE PACKAGE LICENSE for the governing permissions
 *  and limitations under the License.
 */

/* Includes ***************************************************************/
#include "main.h"
#include "Board.h"

/* Private includes *******************************************************/
#include "apm32f4xx_pmu.h"
#include "apm32f4xx_fmc.h"
#include "apm32f4xx_gpio.h"
#include "apm32f4xx_misc.h"
#include "apm32f4xx_usart.h"
#include "apm32f4xx_rcm.h"
#include "board_delay.h"
#include "log_printf.h"
#include "low_power_modes.h"
#include <stdio.h>

/* Private macro **********************************************************/
#define DEBUG_USART  USART1

#define SYS_SLEEP_MODE                  1
#define SYS_STOP_MODE                   0
#define SYS_STANDBY_MODE                0
#define SYS_STANDBY_RTC_MODE            0
#define SYS_STANDBY_RTC_BKPSRAM_MODE    0

/* Private typedef ********************************************************/

/* Private variables ******************************************************/

/* Private function prototypes ********************************************/

/* External variables *****************************************************/

/* External functions *****************************************************/

/*!
 * @brief       Main program
 *
 * @param       None
 *
 * @retval      None
 */
int main(void)
{
    SystemClockConfig();
    USART_Config_T usartConfigStruct;

    /* USART configuration */
    USART_ConfigStructInit(&usartConfigStruct);
    usartConfigStruct.baudRate = 115200;
    usartConfigStruct.mode = USART_MODE_TX_RX;
    usartConfigStruct.parity = USART_PARITY_NONE;
    usartConfigStruct.stopBits = USART_STOP_BIT_1;
    usartConfigStruct.wordLength = USART_WORD_LEN_8B;
    usartConfigStruct.hardwareFlow = USART_HARDWARE_FLOW_NONE;

    /* COM1 init*/
    BOARD_COMInit(COM1, &usartConfigStruct);

    /* Configure LED GPIO Pin */
    BOARD_LEDInit(LED2);
    BOARD_LEDInit(LED3);

    BOARD_PBInit(BUTTON_KEY2, BUTTON_MODE_GPIO);

    /* Configure Delay */
    BOARD_DelayConfig();

    LOG_Print("System reset\r\n");
    
    /* Enable PMU clock*/
    RCM_EnableAPB1PeriphClock(RCM_APB1_PERIPH_PMU);
    PMU_Reset();

    /* Allow access to Backup domain*/
    PMU_EnableBackupAccess();
    
    /* Reset RTC*/
    RCM_EnableBackupReset();
    RCM_DisableBackupReset();
    
    /* If system was resumed from Standby mode*/
    if(PMU_ReadStatusFlag(PMU_FLAG_SB) != RESET)
    {
        PMU_ClearStatusFlag(PMU_FLAG_SB);
        LOG_Print("System was resumed from Standby mode\r\n");
        
        while(1)
        {
            BOARD_LEDToggle(LED2);
            BOARD_DelayMs(500);
        }
    }
    
    LOG_Print("Please press KEY2 to run specific mode\r\n");
    while(BOARD_PBGetState(BUTTON_KEY2) != RESET)
    {
    }
    LOG_Print("Waitting KEY2 release\r\n");
    while(BOARD_PBGetState(BUTTON_KEY2) == RESET)
    {
    }
    
#if (SYS_STANDBY_RTC_BKPSRAM_MODE)
    LOG_Print("Run SYS_STANDBY_RTC_BKPSRAM_MODE\r\n");
    ConsumptionMeasure_StandbyRTCBKPSRAMMode();
#elif (SYS_STANDBY_RTC_MODE)
    LOG_Print("Run SYS_STANDBY_RTC_MODE\r\n");
    ConsumptionMeasure_StandbyRTCMode();
#elif (SYS_STANDBY_MODE)
    LOG_Print("Run SYS_STANDBY_MODE\r\n");
    ConsumptionMeasure_StandbyMode();
#elif (SYS_STOP_MODE)
    LOG_Print("Run SYS_STOP_MODE\r\n");
    ConsumptionMeasure_StopMode();
#elif (SYS_SLEEP_MODE)
    LOG_Print("Run SYS_SLEEP_MODE\r\n");
    ConsumptionMeasure_SleepMode();
#else
    LOG_Print("Run normal mode\r\n");
    while (1)
    {
        BOARD_DelayMs(500);
        BOARD_LEDToggle(LED3);
    }
#endif
}

/*!
 * @brief     Configure Brown-out Reset
 *
 * @param     level :BOR level
 *              @arg FMC_OPT_BOR_LV3 : Supply voltage ranges from 2.7 to 3.6 V
 *              @arg FMC_OPT_BOR_LV2 : Supply voltage ranges from 2.4 to 2.7 V
 *              @arg FMC_OPT_BOR_LV1 : Supply voltage ranges from 2.1 to 2.4 V
 *              @arg FMC_OPT_BOR_OFF : Supply voltage ranges from 1.62 to 2.1 V
 *
 * @retval    None
 */
void BOR_Config(FMC_OPT_BOR_T level)
{
    uint8_t BOROptionByteTemp;
    
    /* Read BOR OB from flash*/
    BOROptionByteTemp = FMC_OPT_ReadBrownoutReset();

    if((BOROptionByteTemp & 0x0C) != level)
    {
        /* Unlocks option bytes block*/
        FMC_UnlockOptionByte();
        
        /* Configures the BOR level*/
        FMC_OPT_ConfigBrownoutReset(level);
        
        /* Launch the option byte loading*/
        FMC_OPT_Launch();
        
        /* Locks option bytes block*/
        FMC_LockOptionByte();
        
        LOG_Print("The BOR value is set from 0x%02X to 0x%02X\r\n",BOROptionByteTemp,level);
    }
    else
    {
        LOG_Print("The BOR setting is the same as in option bytes\r\n");
    }
}

#if defined (__CC_ARM) || defined (__ICCARM__) || (defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050))

/*!
* @brief       Redirect C Library function printf to serial port.
*              After Redirection, you can use printf function.
*
* @param       ch:  The characters that need to be send.
*
* @param       *f:  pointer to a FILE that can recording all information
*              needed to control a stream
*
* @retval      The characters that need to be send.
*
* @note
*/
int fputc(int ch, FILE* f)
{
    /* send a byte of data to the serial port */
    USART_TxData(DEBUG_USART, (uint8_t)ch);

    /* wait for the data to be send  */
    while (USART_ReadStatusFlag(DEBUG_USART, USART_FLAG_TXBE) == RESET);

    return (ch);
}

#elif defined (__GNUC__)

/*!
* @brief       Redirect C Library function printf to serial port.
*              After Redirection, you can use printf function.
*
* @param       ch:  The characters that need to be send.
*
* @retval      The characters that need to be send.
*
* @note
*/
int __io_putchar(int ch)
{
    /* send a byte of data to the serial port */
    USART_TxData(DEBUG_USART, ch);

    /* wait for the data to be send  */
    while (USART_ReadStatusFlag(DEBUG_USART, USART_FLAG_TXBE) == RESET);

    return ch;
}

/*!
* @brief       Redirect C Library function printf to serial port.
*              After Redirection, you can use printf function.
*
* @param       file:  Meaningless in this function.
*
* @param       *ptr:  Buffer pointer for data to be sent.
*
* @param       len:  Length of data to be sent.
*
* @retval      The characters that need to be send.
*
* @note
*/
int _write(int file, char* ptr, int len)
{
    int i;

    UNUSED(file);

    for (i = 0; i < len; i++)
    {
        __io_putchar(*ptr++);
    }

    return len;
}

#else
#warning Not supported compiler type
#endif
